 #include "iostream"
using namespace std;

/*一维数组:
 *     数据类型 数组名[n];
 *二维数组:
 *     数据类型 数组名[n][m];
 *三维数组:
 *     数据类型 数组名[n][m][i];
 *四维数组:
 *     数据类型 数组名[n][m][i].....[a];
 *
 * 最大使用建议到三维
 */
int main()
{
    int v1[2][2];
    v1[0][0] = 11;
    v1[0][1] = 22;

    v1[1][0] = 33;
    v1[1][1] = 44;

    int v2[2][2] = {{11,22}, {33,44}};
    cout << "v1数组中的第二个元素内的第一个元素是: " << v1[1][0] << endl;
    cout << "v2数组中的第一个元素内的第二个元素是: " << v1[0][1] << endl;
    cout << endl;

    int v3[2][2][2];
    v3[0][0][0] = 1;
    v3[0][0][1] = 2;
    v3[0][1][0] = 3;
    v3[0][1][1] = 4;

    v3[1][0][0] = 5;
    v3[1][0][1] = 6;
    v3[1][1][0] = 7;
    v3[1][1][1] = 8;

    int v4[2][2][2] ={{{1,2},{3,4}},{{5,6},{7,8}}};

    cout << "三维数组v3数组中的第一个元素中的第二个元素中的第一个元素是: " << v3[0][1][0] << endl;
    cout << "三维数组v4数组中的第二个元素中的第二个元素中的第一个元素是: " << v3[1][1][0] << endl;

    return 0;
}